Catalogs/Кошки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Кошки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Породы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окрас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Окрасы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШерсти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШерсти</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвалидность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РезультатыВзвешиваний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВзвешиваний</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НомераМикрочипов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераМикрочипов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМикрочипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФотографииКошек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФотографииКошек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФотографияКошки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Кошки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтаФорма.Объект.Ссылка = Неопределено Тогда
		
		ЗаполнитьВес();
	
		ЗаполнитьНомерЧипа();
	
		ОбновитьФотографии();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВес()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыВзвешиванийСрезПоследних.Вес КАК Вес,
		|	РезультатыВзвешиванийСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.РезультатыВзвешиваний.СрезПоследних(&Период, Кошка = &Кошка) КАК РезультатыВзвешиванийСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", ЭтаФорма.Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Вес = Выборка.Вес;
		ЭтаФорма.ДокументВзвешивания = Выборка.Регистратор;
	Иначе
		ЭтаФорма.Вес = 0.0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерЧипа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераМикрочиповСрезПоследних.НомерМикрочипа КАК НомерМикрочипа
		|ИЗ
		|	РегистрСведений.НомераМикрочипов.СрезПоследних(&Период, Кошка = &Кошка) КАК НомераМикрочиповСрезПоследних";
	
	Запрос.УстановитьПараметр("Кошка", ЭтаФорма.Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.НомерМикрочипа = Выборка.НомерМикрочипа;
	Иначе
		ЭтаФорма.НомерМикрочипа = "ХХХХХХХХХХХХХХХ";
	КонецЕсли;;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФотографии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФотографииКошек.ФотографияКошки КАК Фотография
	|ИЗ
	|	РегистрСведений.ФотографииКошек КАК ФотографииКошек
	|ГДЕ
	|	ФотографииКошек.Кошка = &Кошка";
	Запрос.УстановитьПараметр("Кошка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Фотографии.Очистить();
	Пока Выборка.Следующий() Цикл
		Фотографии.Добавить(Выборка.Фотография);
	КонецЦикла;
	
	Если Фотографии.Количество() > 0 Тогда
		ОтобразитьКартинку();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКартинку()
	АдресКартинки = ПоместитьВоВременноеХранилище(Фотографии.Получить(ИндексКартинки).Значение.Получить());
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВлево(Команда)
	ИндексКартинки = ?(ИндексКартинки = 0, Фотографии.Количество()-1, ИндексКартинки - 1);
	ОтобразитьКартинку();
КонецПроцедуры

&НаКлиенте
Процедура ЛистатьВправо(Команда)
	ИндексКартинки = ?(ИндексКартинки = Фотографии.Количество()-1, 0, ИндексКартинки + 1);
	ОтобразитьКартинку();
КонецПроцедуры
